class Util
  class << self
    def import_product
      base_url = "http://m.17dutyfree.com"
      img_base_url = "http://img.17dutyfree.com/pimg/1000"
      # 9..48
      ActiveRecord::Base.transaction do
        (9..35).each do |id|
          page = 0
          loop do
            page += 1
            url = "#{base_url}/category/#{id}?format=json&p=#{page}"
            json = []
            begin
              json = JSON.parse(RestClient.get(url).body)
            rescue
            end
            break if json.length == 0
            json.each do |product_json|
              next if Product.exists?(image: "#{img_base_url}/#{product_json["image"]}")
              product = Product.create!(
                name: product_json["name"],
                brand: product_json["brand"],
                image: "#{img_base_url}/#{product_json["image"]}"
              )
              detail_url = "#{base_url}#{product_json["url"]}"
              detail = RestClient.get(detail_url).body
              airports = detail.scan(Regexp.new(">([^<]*机场)<")).flatten
              prices = detail.scan(Regexp.new("¥ ([0-9\.]*)<")).flatten
              airports.each.with_index do |airport, index|
                product.prices.create!(
                  location: airport,
                  price: (prices[index].to_f * 100).to_i,
                )
              end
            end
          end
        end
      end
    end

    def import_test_data
      data = Docx::Document.open(File.join(Rails.root, "data_files/test.docx")).paragraphs.first.to_s
      # 59 Question
      question = []
      current_test = []
      current_question = {}
      data.split(160.chr(Encoding::UTF_8)).select{|x| x[0].in? ["A", "B", "C", "D", "E", "Q" ]}.each do |line|
        if line[0] == "Q"
          current_test << current_question if current_question.present?
          current_question = {
            question: line,
            answers: [],
          }
          if line[1..2] == "1."
            question << current_test if current_test.present?
            current_test = []
          end
        else
          current_question[:answers] << line
        end
      end
      current_test << current_question
      question << current_test

      question
    end

    # Array<Array<Hash>>
    # Hash
    # question: String
    # answsers: Array
    def test_data
      [
        [
          {"question"=>"Q1. 洗完脸后的2-3小时，不在脸上涂任何保湿/防晒产品、化妆水、粉底或任何产品，这时如果在明亮的光线下照镜子，你的前额和脸颊部位：", "answers"=>["A. 非常粗糙、出现皮屑，或者如布满灰尘般的晦暗", "B. 仍有紧绷感", "C. 能够回复正常的润泽感而且在镜中看不到反光", "D. 能看到反光"]}, {"question"=>"Q2. 在自己以往的照片中，你的脸是否显得光亮：", "answers"=>["A. 从不，或你从未意识到有这种情况", "B. 有时会", "C. 经常会", "D. 历来如此"]}, {"question"=>"Q3.　上妆或使用粉底，但是不涂干的粉（如质地干燥的粉饼或散粉），2-3小时后，你的妆容看起来：", "answers"=>["A. 出现皮屑，有的粉底在皱纹里结成小块", "B. 光滑", "C. 出现闪亮", "D. 出现条纹并且闪亮", "E. 我从不用粉底"]}, {"question"=>"Q4. 身处干燥的环境中，如果不用保湿产品或防晒产品，你的面部皮肤：", "answers"=>["A. 感觉很干或锐痛", "B. 感觉紧绷", "C. 感觉正常", "D. 看起来有光亮，或从不觉得此时需要用保湿产品", "E. 不知道"]}, {"question"=>"Q5. 照一照有放大功能的化妆镜，从你的脸上能看到多少大头针尖大小", "answers"=>["A. 一个都没有", "B. T区（前额和鼻子）有一些", "C. 很多", "D. 非常多", "E. 不知道（注意：反复检查后仍不能判断状况时才选E）"]}, {"question"=>"Q6. 如果让你描述自己的面部皮肤特征，你会选择：", "answers"=>["A. 干性", "B. 中性（正常）", "C. 混合性", "D. 油性"]}, {"question"=>"Q7. 当你使用泡沫丰富的皂类洁面产品洗脸后，你感觉：", "answers"=>["A. 感觉干燥、或有刺痛的感觉", "B. 感觉有些干燥但是没有刺痛感", "C. 感觉没有异常", "D. 感到皮肤出油", "E. 我从不使用皂类或其他泡泡类的洁面产品（如果这是因为它们会使你的皮肤感觉干和不舒服，请选A）"]}, {"question"=>"Q8.　如果不使用保湿产品，你的脸部觉得干吗：", "answers"=>["A. 总是如此", "B. 有时", "C. 很少", "D. 从不"]}, {"question"=>"Q9.　你脸上有阻塞的毛孔吗（包括“黑头”和“白头”）：", "answers"=>["A. 从来没有", "B. 很少有", "C. 有时有", "D. 总是出现"]}, {"question"=>"Q10.　T区（前额和鼻子一带）出油吗：", "answers"=>["A. 从没有油光", "B. 有时会有出油现象", "C. 经常有出油现象", "D. 总是油油的"]}, {"question"=>"Q11.　脸上涂过保湿产品后2-3小时，你的两颊部位：", "answers"=>["A. 非常粗糙、脱皮或者如布满灰尘般的晦暗", "B. 干燥光滑", "C. 有轻微的油光", "D. 有油光、滑腻、或者你从不觉得有必要、事实上也不怎么使用保湿产品"]
          }
        ],
        [
          {"question"=>"Q1.　 脸上会出现红色的粉刺、痘痘、痤疮：", "answers"=>["A. 从不", "B. 很少", "C. 至少一个月出现一次", "D. 至少每周出现一次"]}, {"question"=>"Q2.　护肤产品（包括洁面、保湿、化妆水、彩妆等）会引发潮红、痒或是刺痛吗：", "answers"=>["A. 从不", "B. 很少", "C. 经常", "D. 总是如此", "E. 我从不使用以上产品"]}, {"question"=>"Q3.　曾被诊断为痤疮或红斑痤疮（也称酒渣鼻：皮肤的慢性充血性疾病，通常累及面部的中1／3，特点为患部持续性红斑，常伴毛细血管扩张以及水肿、丘疹和脓疱的急性发作。）", "answers"=>["A. 没有", "B. 没去看过，但朋友或熟人说我有", "C. 是的", "D. 是的，而且症状严重", "E. 不确定"]}, {"question"=>"Q4. 　如果你佩带的首饰不是14k金以上的，皮肤发红的几率：", "answers"=>["A. 从不", "B. 很少", "C. 经常", "D. 总是如此", "E. 不确定"]}, {"question"=>"Q5.　防晒产品令你的皮肤发痒、灼烧、发痘或发红：", "answers"=>["A.　从不", "B. 很少", "C. 经常", "D. 总是如此", "E. 我从不使用防晒剂"]}, {"question"=>"Q6.　曾被诊断为局部性皮炎、湿疹、或接触性皮炎（一种过敏性的皮肤发红）", "answers"=>["A. 没有", "B. 朋友或熟人说我有", "C. 是的", "D. 是的，而且症状严重", "E. 不确定"]}, {"question"=>"Q7.　你佩带戒指的皮肤部位发红的几率：", "answers"=>["A. 从不", "B. 很少", "C. 经常", "D. 总是发红", "E. 我不戴戒指"]}, {"question"=>"Q8.　芳香泡泡浴、按摩油或是身体润肤霜会令你的皮肤发痘、发痒、或感觉干燥", "answers"=>["A. 从不", "B. 很少", "C. 经常", "D. 总是", "E. 我从不使用这类产品（如果你不使用的原因是因为会引起以上的症状，请选D）"]}, {"question"=>"Q9.　有使用酒店里提供的香皂洗脸或洗澡的经历，却没什么问题：", "answers"=>["A. 是的", "B. 大部分时候没什么", "C. 不行，我会发痘或发红发痒", "D. 我可不敢用，以前用过，总是不舒服", "E. 我总是用自己带的这些东西，所以不确定"]}, {"question"=>"Q10.　你的直系亲属中有人被诊断为局部性皮炎、湿疹、气喘和/或过敏吗：", "answers"=>["A. 没有", "B. 据我所知有一个", "C. 好几个", "D. 数位家庭成员有局部性皮炎、湿疹、气喘和/或过敏", "E. 不确定"]}, {"question"=>"Q11.　使用含香料的洗涤剂清洗，以及经过防静电处理和烘干的床单时：", "answers"=>["A. 皮肤反应良好", "B. 感觉有点干", "C. 发痒", "D. 发痒发红", "E. 不确定，因为我从不用这些东西"]}, {"question"=>"Q12.　中等强度的运动后、感到有压力或出现生气等其他强烈情绪时，面部皮肤发红的几率：", "answers"=>["A. 从不", "B. 有时", "C. 经常", "D. 总是如此"]}, {"question"=>"Q13.　喝过酒精饮料后，脸变红的情况：", "answers"=>["A. 从不", "B. 有时", "C. 经常", "D. 总是这样，我不喝酒就是因为这个", "E. 我从不饮酒"]}, {"question"=>"Q14.　吃辣或热的食物/饮料会导致皮肤发红的情况：", "answers"=>["A. 从不", "B. 有时", "C. 经常", "D. 总是这样", "E. 我从不吃辣（如果是因为怕皮肤发红请选D）"]}, {"question"=>"Q15.　脸和鼻子的部位有多少能用肉眼看到的皮下破裂毛细血管（呈红色或蓝色），或者你曾经为此做过治疗：", "answers"=>["A. 没有", "B. 有少量（全脸，包括鼻子有1-3处）", "C. 有一些（全脸，包括鼻子有4-6处）", "D. 很多（全脸，包括鼻子有7处或以上）"]}, {"question"=>"Q16. 从照片上看，你的脸看上去发红吗：", "answers"=>["A. 从不，或没注意有这样的问题", "B. 有时", "C. 经常", "D. 是这样"]}, {"question"=>"Q17.　人们会问你是不是被晒伤了之类的话，而其实你并没有：", "answers"=>["A. 从不", "B. 有时", "C. 总是这样", "D. 我总被晒伤（这可够糟糕的！）"]}, {"question"=>"Q18.　你因为涂了彩妆、防晒霜或其他护肤品发生发红、发痒或面部肿胀：", "answers"=>["A. 从不", "B. 有时", "C. 经常", "D. 总是这样", "E. 我从不用这些东西(如果不用是因为曾经发生过以上症状，请选D)"]
          }
        ],
        [
          {"question"=>"Q1.　长过痘痘或毛发倒生后的部位会留下深棕色/黑色的印记：", "answers"=>["A. 从不", "B. 有时会", "C. 经常会", "D. 总是这样", "E. 我从没长过痘痘或倒生的毛发"]}, {"question"=>"Q2.　被割伤后，棕色的印记（不是新愈合时粉色的疤）会残留多久：", "answers"=>["A. 我不会留下棕色的疤痕", "B. 1周", "C. 几周", "D. 好几个月"]}, {"question"=>"Q3.　当你怀孕、服用口服避孕药丸或其他荷尔蒙替代类药物时，脸上会长出多少深色斑点：", "answers"=>["A. 没有", "B. 1个", "C. 少量", "D. 很多", "E. 这个问题不适用于我（因为我是男性、或者我从未怀孕或服过以上药物、或者我不确认是否有斑点）"]}, {"question"=>"Q4.　你的上唇或面颊有深色斑点/块吗？或者曾经有，你通过一些方法把它们除去了：", "answers"=>["A. 没有", "B. 我不确定", "C. 是的，它们现在（曾经）比较明显", "D. 是的，它们现在（曾经）非常明显"]}, {"question"=>"Q5.　日晒之后斑点会加深吗：", "answers"=>["A. 我没有深色斑点", "B. 无法确定", "C. 有点加深", "D. 变深很多", "E. 我整天都涂防晒霜从不直接接触阳光（如果是因为你特别担心或曾经被晒出斑来才这样做，请选D）"]}, {"question"=>"Q6.　你的面部皮肤曾经被诊断为有色素沉积、或有浅/深棕/灰色斑：", "answers"=>["A. 没有", "B. 有一次，但后来消失了", "C. 是的", "D. 是的，而且状况严重", "E. 无法确认"]}, {"question"=>"Q7.　脸部、前胸、后背或手臂是否有或者曾经有小的棕色斑点（雀斑或晒斑）：", "answers"=>["A. 没有", "B. 有一些（1-5个）", "C. 有很多（6-15个）", "D. 非常多（16个以上）"]}, {"question"=>"Q8.　几个月来第一次晒太阳（例如刚入春或入夏），皮肤感觉：", "answers"=>["A. 灼热", "B. 灼热然后变黑", "C. 直接变黑", "D. 我的肤色已经很深了，我也分不清这样是否会变得更深"]}, {"question"=>"Q9.　连续数天暴露于阳光下：", "answers"=>["A. 灼热甚至起泡，但我的肤色没有什么变化", "B. 肤色变深了一点", "C. 肤色变深了很多", "D. 我的肤色已经很深了，我也分不清这样是否会变得更深", "E. 不确定（如果近期没有，可以回忆一下小时候的经历）"]}, {"question"=>"Q10.　你的天然发色是：", "answers"=>["A. 金发", "B. 棕色", "C. 黑色", "D. 红色"]
          }
        ],
        [
          {"question"=>"Q1.　你现在脸上有皱纹吗？", "answers"=>["A. 没有，即使是在做微笑、皱眉、抬眉毛这些表情的时候也没有", "B. 只有当我微笑、皱眉、抬眉时才有", "C. 是的，做表情时有，不运动到的部位也有少量的", "D. 即使面无表情，也有明显的皱纹"]}, {"question"=>"Q2. 你母亲的面部皮肤看起来", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和其他同龄人一样", "C. 比同龄人年老5岁的样子", "D. 老不止5岁的样子", "E. 问题不适用于我，我是被收养的，或者记不清了"]}, {"question"=>"Q3. 你父亲的面部皮肤看起来", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和其他同龄人一样", "C. 比同龄人年老5岁的样子", "D. 老不止5岁的样子", "E. 问题不适用于我，我是被收养的，或者记不清了"]}, {"question"=>"Q4. 你外祖母的面部皮肤看起来", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和其他同龄人一样", "C. 比同龄人年老5岁的样子", "D. 老不止5岁的样子", "E. 问题不适用于我，我是被收养的，或者记不清了"]}, {"question"=>"Q5. 你外祖父的面部皮肤看起来", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和其他同龄人一样", "C. 比同龄人年老5岁的样子", "D. 老不止5岁的样子", "E. 问题不适用于我，我是被收养的，或者记不清了"]}, {"question"=>"Q6. 你祖母的面部皮肤看起来", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和其他同龄人一样", "C. 比同龄人年老5岁的样子", "D. 老不止5岁的样子", "E. 问题不适用于我，我是被收养的，或者记不清了"]}, {"question"=>"Q7. 你祖父的面部皮肤看起来", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和其他同龄人一样", "C. 比同龄人年老5岁的样子", "D. 老不止5岁的样子", "E. 问题不适用于我，我是被收养的，或者记不清了"]}, {"question"=>"Q8. 在你过往所有的经历中，是否曾经在一年当中连续2周以上持续日晒？如果有，请计算一下这些时间加起来总共有多长？（把你外出打网球、钓鱼、打高尔夫、滑冰/雪等等的户外活动时间都统计进去，要知道可不是只有在海滩的日光浴才属于日晒！）", "answers"=>["A. 从不", "B. 累计1-5年", "C. 累计5-10年", "D. 10年以上"]}, {"question"=>"Q9. 在你过往所有的经历中，你是否在一年当中的无论任何季节日晒2周左右并使皮肤颜色变深？（当然，整个夏季的外出活动都要计算在内）如果有，有多少？", "answers"=>["A. 从不", "B. 累计1-5年", "C. 累计5-10年", "D. 10年以上"]}, {"question"=>"Q10.　根据你居住的地区，你所受到的日照属于什么程度呢？", "answers"=>["A. 很少量；我住的地区以阴天为主", "B. 有一些；我既在鲜有日照的地方生活过，也在日照比较多的地方生活过", "C. 中度的；我居住的地方日照程度中等", "D. 很多；我住在热带、南方或是日照时间很长的地方"]}, {"question"=>"Q11. 你觉得自己看起来几岁？", "answers"=>["A. 比同龄人年轻1-5岁", "B. 和大部分同龄人一样", "C. 比同龄人老1-5岁", "D. 老5岁以上"]}, {"question"=>"Q12.　在过去5年中，你是否因为室外运动或活动有意无意地让自己的肌肤被晒黑过", "answers"=>["A. 没有", "B. 一个月会有一次", "C. 一周会有一次", "D. 每天"]}, {"question"=>"Q13.　是否曾经尝试过或经常进行“美黑疗程”（一种通过模拟阳光来把皮肤晒成小麦色的仪器）", "answers"=>["A. 没有", "B. 1-5次", "C. 5-10次", "D. 很多次"]}, {"question"=>"Q14.在过去所有时间中，你抽烟（或被迫吸入二手烟）的数量", "answers"=>["A. 没有", "B. 几包", "C. 几包至很多包", "D. 我每天吸烟", "E. 我不吸烟，但是成长在吸烟家庭，或是与总是在我身边吸烟的人一同生活或工作"]}, {"question"=>"Q15.请描述你生活的地区的污染状况", "answers"=>["A. 空气清洁新鲜", "B. 除了一年当中的某些时候，这里的空气清洁新鲜", "C. 有轻度污染", "D. 重度污染"]}, {"question"=>"Q16.请描述你使用下列药物（或含这些成份的护肤品）的时间长短：维甲酸（即维A酸，如“维迪软膏”），达芙文（Differin）等", "answers"=>["A. 很多年", "B. 偶尔用", "C. 年轻长痤疮痘痘时用过", "D. 从没用过"]}, {"question"=>"Q17. 目前吃水果蔬菜的频率", "answers"=>["A. 每餐都吃", "B. 一天一次", "C. 偶尔吃", "D. 从不吃"]}, {"question"=>"Q18. 从过去到现在，蔬菜水果在整个饮食中的比例（果汁不算）", "answers"=>["A. 75-100%", "B. 25-75%", "C. 10-25%", "D. 0-10%"]}, {"question"=>"Q19.你的自然肤色为", "answers"=>["A. 深色", "B. 中等肤色", "C. 浅色", "D. 很浅"]}, {"question"=>"Q20. 你的种族", "answers"=>["A. 非洲裔美国人/加勒比人/黑人", "B. 亚裔/印度/地中海人", "C. 拉丁美洲/西班牙人后裔", "D. 高加索人（白种人）"]
          }
        ]
      ]
    end
  end
end
